Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Predefined Topology
ja_jp: 定義済のトポロジー

source: Predefined topology
ja_jp: 定義済のトポロジー

source: Prediction endpoints
ja_jp: 予測エンドポイント

source: Predictions are evaluated based on a PMML model, whose standard and specifications may be read http://dmg.org/pmml/v4-4-1/GeneralStructure.html[here]. Let's start by adding a simple PMML file: `LogisticRegressionIrisData.pmml`. It contains a _Regression_ model named `LogisticRegressionIrisData`, and it uses a regression function to predict plant species from sepal and petal dimensions:
ja_jp: 予測値はPMMLモデルに基づいて評価されます。PMMLモデルの標準と仕様は link:http://dmg.org/pmml/v4-4-1/GeneralStructure.html[こちら]をご覧ください。まず、簡単なPMMLファイル: `LogisticRegressionIrisData.pmml` を追加してみましょう。このファイルには `LogisticRegressionIrisData` という名前の _回帰_ モデルが含まれています。回帰関数を用いて sepal(がく片) と petal(花びら) の寸法からiris（アヤメ）の種類を予測しています:

source: Predictions are evaluated based on a PMML model, whose standard and specifications may be read https://dmg.org/pmml/v4-4-1/GeneralStructure.html[here]. Let's start by adding a simple PMML file: `LogisticRegressionIrisData.pmml`. It contains a _Regression_ model named `LogisticRegressionIrisData`, and it uses a regression function to predict plant species from sepal and petal dimensions:
ja_jp: 予測はPMMLモデルに基づいて評価されます。PMMLモデルの標準と仕様は link:https://dmg.org/pmml/v4-4-1/GeneralStructure.html[こちら] をご覧ください。まず、簡単なPMMLファイル: `LogisticRegressionIrisData.pmml` を追加してみましょう。このファイルには `LogisticRegressionIrisData` という名前の _回帰_ モデルが含まれています。回帰関数を用いて sepal(がく片) と petal(花びら) の寸法からiris（アヤメ）の種類を予測しています:

source: Predictive AI and Data Pipelines
ja_jp: 予測AIとデータパイプライン

source: Predictive AI and Data Pipelines icon
ja_jp: 予測AIとデータパイプラインアイコン

source: Prefix
ja_jp: プレフィックス

source: Prefix for Kafka client `client.id` attribute. If defined configured or generated `client.id` will be prefixed with the given value, otherwise `kafka-consumer-` is the prefix. Type: _string_
ja_jp: Kafka クライアント `client.id` 属性のプレフィックス。定義されている場合は、設定されたか自動生成された `client.id` にプリフィックスされます。そうでない場合は `kafka-consumer-` がプレフィックスとなります。 Type: _string_

source: Prefix for Kafka client `client.id` attribute. If defined configured or generated `client.id` will be prefixed with the given value, otherwise `kafka-producer-` is the prefix. Type: _string_
ja_jp: Kafka クライアント `client.id` 属性のプレフィックス。定義されている場合は、設定されたか自動生成された `client.id` にプリフィックスされます。そうでない場合は `kafka-producer-` がプレフィックスとなります。 Type: _string_

source: Prefix the `mp.messaging.[incoming|outgoing].$channel` entries with `%my-profile` such as `%my-profile.mp.messaging.[incoming|outgoing].$channel.key=value`
ja_jp: `mp.messaging.[incoming|outgoing].$channel` エントリーに `%my-profile` を接頭辞として付け、たとえば、 `%my-profile.mp.messaging.[incoming|outgoing].$channel.key=value` のようにします。

source: Prefix the actual connection details for prod mode with `%prod.` to ensure they are not applied in dev mode. For more information, see the xref:config-reference.adoc#profiles[Profiles] section of the "Configuration reference" guide.
ja_jp: 本番モードの実際の接続詳細の前に `%prod.` を付けて、それらが開発モードで適用されないようにします。 詳細は、「設定リファレンス」の xref:config-reference.adoc#profiles[プロファイル] セクションを参照してください。

source: Preliminary work on Loom's virtual threads
ja_jp: Loomの仮想スレッドに関する準備作業

source: Preload data into Redis
ja_jp: Redisにデータをプリロードする

source: Prepare a JAX-RS response with either the `Fruit` instance if found or the `404` status code.
ja_jp: 見つかった場合は `Fruit` インスタンスまたは `404` ステータスコードのいずれかを使用して JAX-RS 応答を準備します。

source: Prepare a Jakarta REST response with either the `Fruit` instance if found or the `404` status code.
ja_jp: 見つかった場合、 `Fruit` インスタンス、あるいは `404` ステータスコードでJakarta REST 応答を準備します。

source: Prepare the Quarkus HTTP Port
ja_jp: Quarkus の HTTP ポートの準備

source: Prepare the REST test endpoint and set `application.properties` as outlined in the following example:
ja_jp: REST テストエンドポイントを準備し、次の例に示すように `application.properties` を設定します。

source: Prepare the REST test endpoint and set `application.properties`. For example:
ja_jp: REST テストエンドポイントを準備し、 `application.properties` を設定します。 以下に例を示します。

source: Prepare the REST test endpoint, set `application.properties`, for example:
ja_jp: RESTテストエンドポイントを用意し、例えば以下のように `application.properties` を設定します。

source: Prepare the REST test endpoints and set `application.properties`.
ja_jp: REST テストエンドポイントを準備し、 `application.properties` を設定します。

source: Prepare the REST test endpoints and set `application.properties`. For example:
ja_jp: REST テストエンドポイントを準備し、 `application.properties` を設定します。 以下に例を示します。

source: Prepare the REST test endpoints, set `application.properties`, for example:
ja_jp: RESTテストエンドポイントを用意し、 `application.properties` を以下のように設定します。

source: Prepare the REST test endpoints, you can have the test frontend endpoint which uses the injected MP REST client with a registered OidcClient filter to invoke on the downstream endpoint which echoes the token back, for example, see the `integration-tests/oidc-client-wiremock` in the `main` Quarkus repository.
ja_jp: RESTテストエンドポイントを用意します。注入されたMP RESTクライアントを登録されたOidcClientフィルターで使用するテスト用フロントエンドエンドポイントが、トークンをエコーバックするダウンストリームエンドポイントを呼び出すことができます。例として、 `main` Quarkusリポジトリの `integration-tests/oidc-client-wiremock` を参照してください。

source: Prepare the REST test endpoints.
ja_jp: REST テストエンドポイントを準備します。

source: Prepare the REST test endpoints. You can have the test front-end endpoint, which uses the injected MP REST client with a registered OidcClient filter, call the downstream endpoint. This endpoint echoes the token back. For example, see the `integration-tests/oidc-client-wiremock` in the `main` Quarkus repository.
ja_jp: REST テストエンドポイントを用意します。注入された MP REST クライアントを登録された OidcClient フィルターで使用するテスト用フロントエンドエンドポイントが、トークンをエコーバックするダウンストリームエンドポイントを呼び出すことができます。例として、 `main` Quarkus リポジトリーの `integration-tests/oidc-client-wiremock` を参照してください。

source: Prepare the `application.properties` file.
ja_jp: `application.properties` ファイルを準備します。

source: Prepare the `pom.xml` file
ja_jp: `pom.xml` ファイルの準備

source: Prepare the data
ja_jp: データの準備

source: Prepared queries
ja_jp: プリペアドクエリー

source: Preparing an Application: GraphQL API
ja_jp: アプリケーションの準備: GraphQL API

source: Preparing an Application: REST Endpoint and CDI Bean
ja_jp: アプリケーションの準備: RESTエンドポイントとCDIビーン

source: Preparing the infrastructure
ja_jp: インフラの準備

source: Preparing the project for GitHub releases
ja_jp: GitHub リリース用のプロジェクトの準備

source: Prerequisites
ja_jp: 前提条件

source: Press `a` to send the exception to the assistant for analysis.
ja_jp: `a` を押すと、分析のために例外がアシスタントに送信されます。

source: Press `r` again and have the test passing:
ja_jp: もう一度 `r` を押すと、テストが合格します。

source: Press `r` and notice this test failing with `403` which is expected because the test does not send a token to the endpoint:
ja_jp: `r` を押すと、このテストが `403` で失敗していることがわかります。テストはエンドポイントにトークンを送信しないため、これは想定された結果です。

source: Press `r` and the tests will start running. You should see the status change down the bottom of the screen as they are running, and it should finish with:
ja_jp: `r` を押すと、テストの実行が始まります。テストが実行されている間、画面の下の方でステータスが変化し、次のように終了するはずです。

source: Press `r`, while in dev mode, or run the application with:
ja_jp: 開発モードで `r` を押すか、アプリケーションを実行してください：

source: Pretty much like in the xref:metric-resource-class[example above].
ja_jp: xref:metric-resource-class[上記の例] とほぼ同じです。

source: Pretty much like in the xref:telemetry-micrometer.adoc#create-your-own-metrics[Quarkus Micrometer extension], you can create your own metrics using the OpenTelemetry API and the concepts are analogous.
ja_jp: xref:telemetry-micrometer.adoc#create-your-own-metrics[Quarkus Micrometer エクステンション] とほぼ同様に、OpenTelemetry API を使用して独自のメトリクスを作成でき、概念も同じです。

source: Preventing Over-fetching and Under-fetching
ja_jp: オーバーフェッチとアンダーフェッチの防止

source: Preventing client renegotiation
ja_jp: クライアントの再ネゴシエーションの防止

source: Preview and build Quarkus documentation
ja_jp: Quarkusドキュメントのプレビューとビルド

source: Preview environments were introduced to deploy/test services in isolation
ja_jp: サービスを隔離してデプロイ/テストするためのプレビュー環境を導入しました

source: Previewing doc changes on the Quarkus website
ja_jp: QuarkusのWebサイトでdocの変更点をプレビューする

source: Previous examples demonstrated matching all sub-paths when a path concludes with the `$$*$$` wildcard.
ja_jp: 前の例では、パスの末尾が `$$*$$` ワイルドカードの場合に、すべてのサブパスがマッチすることを 示しました。

source: Previous versions of the CLI used options `--group-id` (`-g`),`--artifact-id` (`-a`) and `--version` (`-v`) to specify the groupId, artifactId, and version. If the output isn't what you expect, double check your client version `quarkus version` and help `quarkus create app --help`.
ja_jp: 以前のバージョンの CLI では、オプション `--group-id` (`-g`)、 `--artifact-id` (`-a`)、 `--version` (`-v`) を使用して、groupId、artifactId、およびバージョンを指定していました。出力が期待したものと異なる場合は、 `quarkus version` でクライアントのバージョンとヘルプ `quarkus create app --help` を再度確認してください。

source: Previous versions of the CLI used options `--group-id` (`-g`),`--artifact-id` (`-a`) and `--version` (`-v`) to specify the groupId, artifactId, and version. If the output isn't what you expect, double-check your client version `quarkus version` and help `quarkus create app --help`.
ja_jp: 以前のバージョンの CLI では、オプション `--group-id` (`-g`)、 `--artifact-id` (`-a`)、 `--version` (`-v`) を使用して、groupId、artifactId、およびバージョンを指定していました。出力が期待したものと異なる場合は、 `quarkus version` でクライアントのバージョンとヘルプ `quarkus create app --help` を再度確認してください。

source: Previous versions of the Kubernetes extension supported a different syntax to add environment variables. The older syntax is still supported but is deprecated, and it's advised that you migrate to the new syntax.
ja_jp: Kubernetes エクステンションの以前のバージョンでは、環境変数を追加するための異なる構文をサポートしていました。古い構文はまだサポートされていますが、非推奨ですので、新しい構文に移行することをお勧めします。

source: Previous versions of the Kubernetes extension supported a different syntax to add environment variables.The older syntax is still supported but is deprecated and it's advised that you migrate to the new syntax.
ja_jp: Kubernetes エクステンションの以前のバージョンでは、環境変数を追加するための異なる構文をサポートしていました。古い構文はまだサポートされていますが、非推奨ですので、新しい構文に移行することをお勧めします。

source: Previous versions of the OpenShift extension supported a different syntax to add environment variables. The older syntax is still supported but is deprecated, and it is advised that you migrate to the new syntax.
ja_jp: OpenShift エクステンションの以前のバージョンでは、環境変数を追加するための異なる構文がサポートされていました。古い構文はまだサポートされていますが、非推奨です。

source: Previous versions of the OpenShift extension supported a different syntax to add environment variables. The older syntax is still supported but is deprecated, and it's advised that you migrate to the new syntax.
ja_jp: OpenShift エクステンションの以前のバージョンでは、環境変数を追加するための異なる構文がサポートされていました。古い構文はまだサポートされていますが、非推奨となっており、新しい構文に移行することをお勧めします。

source: Previously described application configuration showed how to map `CN` attribute of the LDAP Distinguished Name group to a Quarkus `SecurityIdentity` role. More specifically, the `standardRole` CN was mapped to a `SecurityIdentity` role and thus allowed access to the `UserResource#me` endpoint. However, required `SecurityIdentity` roles may differ between applications and you may need to map LDAP groups to local `SecurityIdentity` roles like in the example below:
ja_jp: 前述したアプリケーション設定では、LDAP識別名グループの `CN` 属性をQuarkusの `SecurityIdentity` ロールにマッピングする方法を示しました。 具体的には、 `standardRole` CNが `SecurityIdentity` ロールにマップされ、 `UserResource#me` エンドポイントへのアクセスが許可されました。 ただし、必要な `SecurityIdentity` ロールはアプリケーションによって異なる場合があり、以下の例のようにLDAPグループをローカルの `SecurityIdentity` ロールにマッピングする必要がある場合があります：

source: Previously, unparsed character data could start with `{[` and end with `]}`. This syntax is now removed due to common collisions with constructs from other languages.
ja_jp: 以前はパース対象外文字データを `{[` and end with `]}` から始めることができました。この構文は、他の言語の構文とよく衝突するため、現在では削除されています。

source: Previously, unparsed character data had to start with `{[` and end with `]}`. This syntax is still supported but we encourage users to switch to the new syntax to avoid some common collisions with constructs from other languages.
ja_jp: 以前は、パース対象外文字データは `{[` で始まり `]}` で終わる必要がありました。この構文はまだサポートされていますが、他の言語の構文とのよくある衝突を避けるために、新しい構文に切り替えることをお勧めします。

source: Primary token
ja_jp: プライマリートークン

source: Primary token is a source of roles by default: ID token is checked for roles in the authorization code flow and the access token is checked for roles in the bearer token flow. If the application uses the authorization code flow, and you need to check the access token, as opposed to the primary ID token, then you can do `quarkus.oidc.roles.source=access_token` - you do not need to set this property if you deal with bearer access tokens.
ja_jp: デフォルトではプライマリートークンがロールのソースとなります。認可コードフローでは ID トークンのロールがチェックされ、ベアラートークンフローではアクセストークンのロールがチェックされます。アプリケーションで認可コードフローを使用しており、プライマリーな ID トークンではなくアクセストークンをチェックする必要がある場合は、`quarkus.oidc.roles.source=access_token` と設定できます。ベアラーアクセストークンを扱う場合は、このプロパティーを設定する必要はありません。

source: Primitive types
ja_jp: プリミティブ型

source: Primitive types can also be passed as input using the standard JSON mapping for them. To execute the `toLowerCase` function defined in link:{quickstarts-tree-url}/funqy-quickstarts/funqy-http-quickstart/src/main/java/org/acme/funqy/PrimitiveFunctions.java[PrimitiveFunctions.java] invoke this curl script:
ja_jp: プリミティブ型は、標準的なJSONマッピングを使用して入力として渡すこともできます。 link:{quickstarts-tree-url}/funqy-quickstarts/funqy-http-quickstart/src/main/java/org/acme/funqy/PrimitiveFunctions.java[PrimitiveFunctions.java] で定義された `toLowerCase` 関数を実行するには、次のcurlスクリプトを実行します：

source: Primitive types can also be passed as input using the standard JSON mapping for them. To execute the `toLowerCase` function defined in {quickstarts-tree-url}/funqy-quickstarts/funqy-http-quickstart/src/main/java/org/acme/funqy/PrimitiveFunctions.java[PrimitiveFunctions.java] invoke this curl script:
ja_jp: プリミティブ型は、標準の JSON マッピングを使用して入力として渡すこともできます。 `toLowerCase` function defined in {quickstarts-tree-url}/funqy-quickstarts/funqy-http-quickstart/src/main/java/org/acme/funqy/PrimitiveFunctions.java[PrimitiveFunctions.java] で定義されている `toLowerCase` 関数を実行するには、この curl スクリプトを呼び出します。

source: Primitive types.
ja_jp: プリミティブ型

source: Primitives
ja_jp: プリミティブ

source: Primitives: `boolean`, `byte`, `short`, etc.
ja_jp: プリミティブ: `boolean`、 `byte`、 `short` など

source: Principal Class
ja_jp: プリンシパルクラス

source: Principal claim
ja_jp: プリンシパルクレーム

source: Principles of the new design
ja_jp: 新設計の原則

source: Printing step execution time
ja_jp: ステップ実行時間の出力

source: Printing the details can be expensive as the values are retrieved from the caller. The details include the source class name, source file name, source method name, and source line number.
ja_jp: 詳細の表示は、呼び出し元から値を取得するため、コストがかかる場合があります。詳細には、ソースクラス名、ソースファイル名、ソースメソッド名、ソース行番号などが含まれます。

source: Printing the details can be expensive as the values are retrieved from the caller. The details include the source class name, source file name, source method name and source line number.
ja_jp: 呼び出し元から値を取得するため、詳細を表示するとコストがかかります。詳細には、ソースクラス名、ソースファイル名、ソースメソッド名、ソース行番号が含まれます。

source: Prints the failures to the console again, this can be useful if there has been lots of console output since the last run.
ja_jp: 失敗をコンソールに再表示します。これは、前回の実行後に大量のコンソール出力があった場合に役立ちます。

source: Prior to Java 21, virtual threads were still an experimental feature, you need to start your application with the `--enable-preview` flag.
ja_jp: Java 21 以前では、仮想スレッドはまだ実験的な機能であったため、 `--enable-preview` フラグを付けてアプリケーションを起動する必要があります。

source: Prior to Quarkus 3.0 it was also possible to inject a `@RequestScoped` bean for `Mutiny.Session`. However, the lifecycle of a reactive session does not fit the lifecycle of the CDI request context. Therefore, this bean is removed in Quarkus 3.0.
ja_jp: Quarkus 3.0以前は、 `Mutiny.Session` に `@RequestScoped` Beanを注入することも可能でした。しかし、リアクティブセッションのライフサイクルは、CDIリクエストコンテキストのライフサイクルに適合しません。そのため、Quarkus 3.0では、このBeanは削除されました。

source: Prior to Quarkus 3.16, when using `$in` with a list, you had to write your query with `{'status':{$in: [?1]}}`. Starting with Quarkus 3.16, make sure you use `{'status':{$in: ?1}}` instead. The list will be properly expanded with surrounding square brackets.
ja_jp: Quarkus 3.16 より前のバージョンでは、リストのある `$in` を使用する場合、クエリーを `{'status':{$in: [?1]}}` のように記述する必要がありました。Quarkus 3.16 以降では、代わりに `{'status':{$in: ?1}}` を使用してください。リストは、適切に角括弧で囲まれて展開されます。

source: Prior to Quarkus 3.9 and the Infinispan 15 integration, queries were executed by calling the following code: .Query.java
ja_jp: Quarkus 3.9とInfinispan 15の統合以前は、クエリは以下のコードを呼び出して実行されていました：.Query.java

source: Priorities of the supported authentication mechanisms
ja_jp: サポートされている認証メカニズムの優先度

source: Priority is assigned by a `io.quarkus.load.shedding.RequestPrioritizer`. There is 5 statically defined priorities in the `io.quarkus.load.shedding.RequestPriority` enum: `CRITICAL`, `IMPORTANT`, `NORMAL`, `BACKGROUND` and `DEGRADED`. By default, if no request prioritizer applies, the priority is assumed to be `NORMAL`.
ja_jp: 優先度は `io.quarkus.load.shedding.RequestPrioritizer` によって割り当てられます。 `io.quarkus.load.shedding.RequestPriority` 列挙には、 `CRITICAL`、 `IMPORTANT`、 `NORMAL`、 `BACKGROUND`、 `DEGRADED` の 5 つの静的に定義された優先度があります。 デフォルトでは、リクエスト prioritizer が適用されない場合、優先度は `NORMAL` であると見なされます。

source: Priority level for a consumer to which a broker gives more priority while dispatching messages in Shared subscription type. + The broker follows descending priorities. For example, 0=max-priority, 1, 2,... + In Shared subscription type, the broker **first dispatches messages to the max priority level consumers if they have permits**. Otherwise, the broker considers next priority level consumers. + **Example 1** + If a subscription has consumerA with `priorityLevel` 0 and consumerB with `priorityLevel` 1, then the broker **only dispatches messages to consumerA until it runs out permits** and then starts dispatching messages to consumerB. + **Example 2** + Consumer Priority, Level, Permits + C1, 0, 2 + C2, 0, 1 + C3, 0, 1 + C4, 1, 2 + C5, 1, 1 + Order in which a broker dispatches messages to consumers is: C1, C2, C3, C1, C4, C5, C4.
ja_jp: 共有サブスクリプションタイプでメッセージをディスパッチする際に、ブローカーがより優先順位を与えるコンシューマーの優先順位レベル。 ブローカーは優先順位の降順に従います。例えば、0=最大優先度、1、2、...のように。 共有サブスクリプションタイプでは、ブローカーは *まず、最大優先度レベルのコンシューマーが許可を持っていれば、そのコンシューマーにメッセージをディスパッチ* します。そうでない場合、ブローカーは次の優先順位のコンシューマーを考慮します。 *例1* サブスクリプションに `priorityLevel` 0 の consumerA と `priorityLevel` 1 の consumerB がある場合、ブローカはパーミットを *使い果たすまで consumerA にのみメッセージをディスパッチ* し、その後 consumerB にメッセージをディスパッチし始めます。 *例2* コンシューマの優先度、レベル、パーミット C1, 0, 2 C2, 0, 1 C3, 0, 1 C4, 1, 2 C5, 1, 1

source: Priority load shedding
ja_jp: 優先負荷制限

source: Priority load shedding is currently always based on CPU load. Other mechanisms are possible (such as network utilization), but currently not implemented.
ja_jp: 優先負荷制限は現在、常に CPU 負荷に基づいています。他のメカニズム (ネットワーク使用率など) も可能ですが、現在は実装されていません。

source: Priority of authentication mechanisms
ja_jp: 認証メカニズムの優先度

source: Priority of obtained properties
ja_jp: 取得したプロパティーの優先順位

source: Privacy Enhanced Mail (PEM) keystores are composed of a list of file pairs:
ja_jp: Privacy Enhanced Mail (PEM) キーストアは、ファイルペアのリストから構成されます。

source: Privacy Policy
ja_jp: プライバシーポリシー

source: Private Key JWT
ja_jp: 秘密鍵 JWT

source: Private static methods are never intercepted
ja_jp: プライベートなスタティックメソッドは決して傍受されません。

source: Proactive Authentication
ja_jp: プロアクティブ認証

source: Proactive HTTP authentication must be disabled (`quarkus.http.auth.proactive=false`) for this to work. For more information, see the xref:security-proactive-authentication.adoc[Proactive authentication] guide.
ja_jp: これを機能させるには、プロアクティブ HTTP 認証を無効にする必要があります (`quarkus.http.auth.proactive=false`)。 詳細は、xref:security-proactive-authentication.adoc[プロアクティブ認証] ガイドを参照してください。

source: Proactive HTTP authentication needs to be disabled (`quarkus.http.auth.proactive=false`) for this to work. See xref:security-built-in-authentication.adoc#proactive-authentication[Proactive Authentication] section for further details.
ja_jp: そのためには、プロアクティブ HTTP 認証を無効 (`quarkus.http.auth.proactive=false`) にする必要があります。詳細については、xref:security-built-in-authentication.adoc#proactive-authentication[プロアクティブ認証] セクションを参照してください。

source: Proactive authentication
ja_jp: プロアクティブ認証

source: Proactive authentication is enabled in Quarkus by default.
ja_jp: Quarkusでは、プロアクティブ認証がデフォルトで有効になっています。

source: Proactive authentication is enabled in Quarkus by default. It ensures that all incoming requests with credentials are authenticated, even if the target page does not require authentication. As a result, requests with invalid credentials are rejected, even if the target page is public.
ja_jp: Quarkusでは、プロアクティブ認証がデフォルトで有効になっています。 これにより、ターゲットページが認証を必要としない場合でも、認証情報を持つすべての受信リクエストが認証されます。 その結果、ターゲットページが公開されている場合でも、無効な認証情報を持つリクエストは拒否されます。

source: Proactive authentication is enabled in Quarkus by default. It ensures that all incoming requests with credentials are authenticated, even if the target page does not require authentication. As a result, requests with invalid credentials are rejected, even if the target page is public. Requests without credentials are not rejected, because anonymous requests are allowed.
ja_jp: Quarkusでは、プロアクティブ認証がデフォルトで有効になっています。 これにより、ターゲットページが認証を必要としない場合でも、認証情報を持つすべての受信リクエストが認証されます。 その結果、ターゲットページが公開されている場合でも、無効な認証情報を持つリクエストは拒否されます。 匿名リクエストが許可されているため、認証情報のないリクエストは拒否されません。

source: Proactive authentication is enabled in Quarkus by default. The request is always authenticated if an incoming request has a credential, even if the target page does not require authentication. For more information, see the Quarkus xref:security-proactive-authentication.adoc[Proactive authentication] guide.
ja_jp: Quarkusでは、デフォルトでプロアクティブ認証が有効になっています。 受信リクエストにクレデンシャルがある場合、ターゲットページに認証が必要ない場合でも、リクエストは常に認証されます。 詳細については、Quarkusの xref:security-proactive-authentication.adoc[プロアクティブ認証] ガイドを参照してください。

source: Proactive authentication is enabled in Quarkus by default. This means that if an incoming request has a credential, the request will always be authenticated, even if the target page does not require authentication. For more information, see the Quarkus xref:security-proactive-authentication.adoc[Proactive authentication] guide.
ja_jp: Quarkusでは、デフォルトでプロアクティブ認証が有効になっています。 受信リクエストに認証情報がある場合、ターゲットページで認証が必要ない場合でも、リクエストは常に認証されます。 詳細については、Quarkus の xref:security-proactive-authentication.adoc[プロアクティブ認証] ガイドを参照してください。

source: Proactive authentication is enabled in Quarkus by default. This means that if an incoming request has a credential then that request will always be authenticated, even if the target page does not require authentication.
ja_jp: Quarkusでは、プロアクティブ認証がデフォルトで有効になっています。つまり、受信リクエストにクレデンシャルがある場合、ターゲットページで認証が必要ない場合でも、そのリクエストは常に認証されることになります。

source: Procedure
ja_jp: 手順

source: Proceed to the next interceptor in the interceptor chain or invoke the intercepted business method.
ja_jp: インターセプターチェーンの次のインターセプターに進むか、インターセプターされたビジネスメソッドを呼び出します。

source: Process ID
ja_jp: プロセスID

source: Process events asynchronously
ja_jp: イベントの非同期処理

source: Process events on virtual threads
ja_jp: 仮想スレッドのイベント処理

source: Process name
ja_jp: プロセス名

source: Processing Messages
ja_jp: メッセージの処理

source: Processing messages
ja_jp: メッセージの処理

source: Processing quote requests
ja_jp: 見積依頼の処理

source: Processors and build steps
ja_jp: プロセッサーとビルドステップ

source: Produce a `JsonRPCProvidersBuildItem`.
ja_jp: `JsonRPCProvidersBuildItem` を生成します。

source: Produce a `ServiceStartBuildItem` to indicate that this is a service starting step that needs to run before the `StartupEvent` is sent.
ja_jp: `ServiceStartBuildItem` を生成し、これが `StartupEvent` の送信前に実行する必要のあるサービス開始ステップであることを示します。

source: Produce a `ServiceStartBuildItem` to indicate the startup of a service. See <<Startup and Shutdown Events>> for details.
ja_jp: サービスの開始を示す `ServiceStartBuildItem` を生成します。詳細は <<スタートアップとシャットダウンのイベント>> を参照してください。
